{
  "exercises": [
    {
      "id": "ex_001",
      "name": "Отжимания на коленях",
      "description": "Исходное положение — упор лёжа на коленях и ладонях, руки расположены на ширине плеч, тело образует прямую линию от колен до головы. Медленно опустите грудь к полу, сгибая локти, затем плавно вернитесь в исходное положение. Это упражнение развивает грудные мышцы, трицепсы и передние дельтовидные мышцы с пониженной нагрузкой, подходящей для новичков.",
      "reps_type": "reps",
      "reps_value": "8–12"
    },
    {
      "id": "ex_002",
      "name": "Планка",
      "description": "Примите положение упора лёжа на предплечьях и носках, локти точно под плечами, тело вытянуто в прямую линию от головы до пяток. Удерживайте это положение, не допуская прогиба в пояснице или подъёма таза. Упражнение эффективно укрепляет мышцы кора, включая прямые и поперечные мышцы живота, а также стабилизаторы спины.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_003",
      "name": "Приседания",
      "description": "Встаньте прямо, ноги на ширине плеч, носки слегка развёрнуты. Отведите таз назад, согните колени и опуститесь до уровня, когда бёдра станут параллельны полу. Спина остаётся прямой, грудь поднятой, колени не выходят за линию носков. Вернитесь в исходное положение. Упражнение укрепляет квадрицепсы, ягодичные мышцы и заднюю поверхность бедра.",
      "reps_type": "reps",
      "reps_value": "15–20"
    },
    {
      "id": "ex_004",
      "name": "Подъёмы на носки",
      "description": "Встаньте прямо, ноги на уровне таза, руки могут быть свободно опущены или на поясе. Медленно поднимитесь на носки, максимально сокращая икроножные мышцы, затем плавно опуститесь вниз, не касаясь пятками пола. Упражнение направлено на развитие икроножных мышц и улучшение устойчивости голеностопных суставов.",
      "reps_type": "reps",
      "reps_value": "20"
    },
    {
      "id": "ex_005",
      "name": "Ягодичный мостик",
      "description": "Лягте на спину, согните ноги в коленях, стопы полностью стоят на полу, руки лежат вдоль тела. Поднимайте таз вверх до тех пор, пока бёдра не образуют прямую линию от колен до плеч. Напрягите ягодицы в верхней точке, затем медленно опуститесь. Упражнение целенаправленно включает ягодичные мышцы и укрепляет поясничный отдел спины.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_006",
      "name": "Подъём прямых ног",
      "description": "Лягте на спину, руки расположены вдоль тела или под ягодицами для поддержки поясницы. Держа ноги полностью прямыми, медленно поднимите их до вертикального положения, затем контролируемо опустите, не касаясь пола. Упражнение фокусируется на проработке нижней части прямой мышцы живота.",
      "reps_type": "reps",
      "reps_value": "12"
    },
    {
      "id": "ex_007",
      "name": "Супермен",
      "description": "Лягте на живот, руки вытянуты вперёд, ноги прямые. Одновременно поднимите грудь, руки и ноги на несколько сантиметров над полом, напрягая мышцы спины. Удерживайте это положение, затем плавно опуститесь. Упражнение укрепляет разгибатели позвоночника и улучшает осанку.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_008",
      "name": "Выпады на месте",
      "description": "Встаньте прямо. Сделайте шаг вперёд одной ногой и опуститесь, пока оба колена не образуют углы около 90 градусов — переднее колено над лодыжкой, заднее почти касается пола. Вернитесь в исходное положение и повторите на другую ногу. Упражнение развивает силу ног и улучшает баланс.",
      "reps_type": "reps",
      "reps_value": "10 на ногу"
    },
    {
      "id": "ex_009",
      "name": "Скручивания",
      "description": "Лягте на спину, согните ноги в коленях, стопы на полу. Поднимайте лопатки от пола, сокращая мышцы живота, при этом поясница остаётся прижатой к полу. Опуститесь плавно, не теряя напряжения в прессе. Это базовое упражнение для верхней части прямой мышцы живота.",
      "reps_type": "reps",
      "reps_value": "20"
    },
    {
      "id": "ex_010",
      "name": "Статическое приседание",
      "description": "Встаньте у стены или без опоры, согните ноги в коленях до угла около 90 градусов, как будто сидите на воображаемом стуле. Держите спину прямой, грудь поднятой, вес на пятках. Удерживайте позу. Упражнение развивает выносливость квадрицепсов и стабилизацию таза.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_011",
      "name": "Бок. планка (прав.)",
      "description": "Лягте на правый бок, опирайтесь на правое предплечье и стопы. Поднимите бёдра так, чтобы тело образовало прямую линию от головы до пяток. Удерживайте положение, не допуская провисания таза. Упражнение укрепляет косые мышцы живота и стабилизаторы корпуса с правой стороны.",
      "reps_type": "time",
      "reps_value": "20"
    },
    {
      "id": "ex_012",
      "name": "Бок. планка (лев.)",
      "description": "Лягте на левый бок, опирайтесь на левое предплечье и стопы. Поднимите бёдра вверх до образования прямой линии от головы до пяток. Сохраняйте устойчивость, не позволяя тазу опускаться. Упражнение укрепляет косые мышцы живота и стабилизаторы корпуса с левой стороны.",
      "reps_type": "time",
      "reps_value": "20"
    },
    {
      "id": "ex_013",
      "name": "Ходьба на ягодицах",
      "description": "Сядьте на пол, ноги вытянуты вперёд, руки скрещены на груди или на поясе. Отталкиваясь ягодицами, перемещайтесь вперёд и назад, не используя руки для толчка. Упражнение активирует ягодичные мышцы и улучшает подвижность таза.",
      "reps_type": "reps",
      "reps_value": "10 шагов"
    },
    {
      "id": "ex_014",
      "name": "Наклоны в стороны",
      "description": "Встаньте прямо, ноги на ширине таза, руки могут быть на поясе или свободно опущены. Наклоняйтесь вправо, затем влево, сохраняя корпус прямым и не наклоняя его вперёд или назад. Упражнение растягивает и укрепляет косые мышцы живота.",
      "reps_type": "reps",
      "reps_value": "15 на сторону"
    },
    {
      "id": "ex_015",
      "name": "Круги руками",
      "description": "Встаньте прямо, вытяните руки в стороны на уровне плеч. Выполняйте круговые движения руками вперёд в течение заданного времени, затем — назад (если указано). Упражнение улучшает подвижность плечевых суставов и разогревает верхнюю часть тела.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_016",
      "name": "Подъём таза лёжа",
      "description": "Лягте на спину, согните ноги в коленях, стопы на полу. Поднимайте и опускайте таз в ритмичном темпе без задержки в верхней точке. Упражнение укрепляет ягодичные мышцы и поясницу, улучшая гибкость тазобедренных суставов.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_017",
      "name": "Повороты корпуса",
      "description": "Встаньте прямо, согните руки перед грудью или сложите их в замок. Поворачивайте корпус вправо и влево, сохраняя таз неподвижным. Упражнение развивает подвижность грудного отдела позвоночника и включает косые мышцы живота.",
      "reps_type": "reps",
      "reps_value": "20"
    },
    {
      "id": "ex_018",
      "name": "Шаги в сторону",
      "description": "Встаньте прямо, ноги вместе. Сделайте шаг вправо, слегка приседая, затем шагните левой ногой вслед. Повторите влево. Упражнение улучшает латеральную подвижность, укрепляет внутреннюю и внешнюю поверхность бёдер.",
      "reps_type": "reps",
      "reps_value": "20 шагов"
    },
    {
      "id": "ex_019",
      "name": "Подъём на пятках",
      "description": "Встаньте прямо. Поднимитесь на пятках, максимально отрывая носки от пола, сохраняя равновесие. Медленно опуститесь. Упражнение укрепляет переднюю (переднебольшеберцовую) мышцу голени и улучшает контроль над стопой.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_020",
      "name": "Растяжка 'кошка-корова'",
      "description": "Встаньте на четвереньки, руки под плечами, колени под бёдрами. На вдохе прогните спину вниз, поднимая грудь и хвост («корова»), на выдохе округлите спину вверх, опуская голову («кошка»). Упражнение улучшает подвижность позвоночника и снимает напряжение в спине.",
      "reps_type": "reps",
      "reps_value": "12"
    },
    {
      "id": "ex_021",
      "name": "Сведение лопаток",
      "description": "Лягте на живот, руки вдоль тела ладонями вниз. Поднимите грудную клетку от пола и сведите лопатки вместе, не задействуя руки. Упражнение укрепляет мышцы верхней части спины, особенно ромбовидные и среднюю часть трапеций.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_022",
      "name": "Повороты лёжа",
      "description": "Лягте на спину, руки разведены в стороны, ноги согнуты в коленях. Медленно опускайте обе ноги вправо, не отрывая плечи от пола, затем — влево. Упражнение растягивает и укрепляет косые мышцы живота и улучшает подвижность поясницы.",
      "reps_type": "reps",
      "reps_value": "16"
    },
    {
      "id": "ex_023",
      "name": "Ходьба на пятках",
      "description": "Ходите вперёд, опираясь только на пятки, носки подняты вверх. Держите спину прямо, руки свободно двигаются. Упражнение укрепляет переднюю часть голени и улучшает координацию.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_024",
      "name": "Ходьба на носках",
      "description": "Ходите вперёд, опираясь только на носки, держа корпус вертикально. Руки могут быть на поясе или свободно. Упражнение укрепляет икроножные мышцы и развивает баланс.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_025",
      "name": "Повороты стоп",
      "description": "Сядьте на стул или на пол, ноги вытянуты. Вращайте стопами по кругу — сначала в одну сторону, затем в другую. Упражнение улучшает подвижность голеностопных суставов и кровообращение в нижних конечностях.",
      "reps_type": "time",
      "reps_value": "20"
    },
    {
      "id": "ex_026",
      "name": "Сжатие ягодиц",
      "description": "Сидя или лёжа, напрягите ягодичные мышцы и удерживайте напряжение указанное время, затем расслабьтесь. Повторите заданное количество раз. Упражнение укрепляет ягодицы и улучшает осознание тела без динамической нагрузки.",
      "reps_type": "time",
      "reps_value": "10"
    },
    {
      "id": "ex_027",
      "name": "Дыхание диафрагмой",
      "description": "Лягте на спину, положите руки на живот. Глубоко вдохните через нос, направляя воздух в живот (он должен подняться), затем медленно выдохните через рот, втягивая живот. Упражнение развивает дыхательную мускулатуру и активирует парасимпатическую нервную систему.",
      "reps_type": "time",
      "reps_value": "60"
    },
    {
      "id": "ex_028",
      "name": "Растяжка 'мостик'",
      "description": "Лягте на спину, согните ноги в коленях, стопы на полу. Поднимите таз и грудную клетку вверх, стараясь приблизить грудь к подбородку, сохраняя шею расслабленной. Удерживайте положение. Упражнение растягивает грудные мышцы и переднюю поверхность плеч, укрепляя спину.",
      "reps_type": "time",
      "reps_value": "20"
    },
    {
      "id": "ex_029",
      "name": "Наклоны вперёд",
      "description": "Встаньте прямо, ноги вместе или на ширине таза. Наклоняйтесь вперёд от бёдер, стараясь дотянуться руками до пола, не сгибая колени. Упражнение растягивает заднюю поверхность бедра и поясничный отдел спины.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_030",
      "name": "Вращения плечами",
      "description": "Встаньте прямо, руки опущены. Выполняйте круговые движения плечами вперёд, затем — назад. Упражнение улучшает подвижность лопаток и разогревает плечевой пояс.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_031",
      "name": "Обратные отжимания",
      "description": "Сядьте на пол, упритесь ладонями в пол за спиной, пальцы направлены вперёд. Согните локти, опуская таз к полу, затем выпрямите руки, поднимая таз. Упражнение целенаправленно нагружает трицепсы и заднюю часть плеч.",
      "reps_type": "reps",
      "reps_value": "10–12"
    },
    {
      "id": "ex_032",
      "name": "Ходьба в планке",
      "description": "Примите положение планки на прямых руках. Шагайте руками вперёд, сохраняя корпус напряжённым и прямым, затем вернитесь назад. Упражнение развивает силу кора и плечевого пояса с динамической компонентой.",
      "reps_type": "reps",
      "reps_value": "20 шагов"
    },
    {
      "id": "ex_033",
      "name": "Колени к груди в планке",
      "description": "В положении планки на предплечьях или прямых руках поочерёдно подтягивайте колени к груди, сохраняя таз устойчивым. Упражнение сочетает статическую нагрузку на кор и динамическую проработку нижней части пресса.",
      "reps_type": "reps",
      "reps_value": "20"
    },
    {
      "id": "ex_034",
      "name": "Планка + рука вперёд",
      "description": "В планке на прямых руках поочерёдно вытягивайте одну руку вперёд, удерживая корпус неподвижным. Упражнение развивает анти-вращательную устойчивость кора и координацию.",
      "reps_type": "reps",
      "reps_value": "10 на руку"
    },
    {
      "id": "ex_035",
      "name": "Повороты с поднят. ногами",
      "description": "Лягте на спину, поднимите ноги под углом 90 градусов. Медленно опускайте согнутые колени вправо, затем влево, не касаясь пола. Упражнение укрепляет косые мышцы живота и улучшает контроль над тазом.",
      "reps_type": "reps",
      "reps_value": "16"
    },
    {
      "id": "ex_036",
      "name": "Прыжки 'звёздочка'",
      "description": "Исходное положение — стойка. Прыгните вверх, широко разводя руки и ноги в стороны, затем вернитесь в исходное положение. Упражнение развивает кардиовыносливость и координацию.",
      "reps_type": "reps",
      "reps_value": "20"
    },
    {
      "id": "ex_037",
      "name": "Диагональные выпады",
      "description": "Из положения стойки шагните одной ногой назад и в сторону по диагонали, опускаясь в выпад. Вернитесь в исходное положение и повторите на другую сторону. Упражнение включает внутреннюю и внешнюю поверхность бедра, улучшает баланс.",
      "reps_type": "reps",
      "reps_value": "8 на ногу"
    },
    {
      "id": "ex_038",
      "name": "Планка-ползунок",
      "description": "Из положения планки на прямых руках шагайте руками вперёд, максимально вытягивая корпус, затем возвращайтесь назад. Упражнение сочетает динамику и стабильность, укрепляя весь мышечный корсет.",
      "reps_type": "reps",
      "reps_value": "10 циклов"
    },
    {
      "id": "ex_039",
      "name": "Боковые выпады",
      "description": "Из положения стойки шагните в сторону одной ногой, сгибая её в колене, вторая нога остаётся прямой. Вернитесь в исходное положение и повторите в другую сторону. Упражнение прорабатывает среднюю ягодичную мышцу и приводящие мышцы бедра.",
      "reps_type": "reps",
      "reps_value": "10 на сторону"
    },
    {
      "id": "ex_040",
      "name": "Планка + подъём таза",
      "description": "В планке на предплечьях поднимайте таз вверх, формируя угол (поза «собака мордой вниз»), затем медленно опускайте. Упражнение растягивает и укрепляет мышцы спины, плеч и задней поверхности бедра.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_041",
      "name": "Берпи без прыжка",
      "description": "Из положения стойки опуститесь в присед, затем поставьте руки на пол и выйдите ногами назад в планку. Выполните отжимание (если указано), затем верните ноги в присед и встаньте. Прыжок вверх исключён. Упражнение развивает выносливость и координацию без ударной нагрузки.",
      "reps_type": "reps",
      "reps_value": "10"
    },
    {
      "id": "ex_042",
      "name": "Подъём ног лёжа",
      "description": "Лягте на спину, руки под ягодицами или вдоль тела. Поднимите прямые ноги под углом 45 градусов и удерживайте это положение. Упражнение целенаправленно нагружает нижнюю часть прямой мышцы живота.",
      "reps_type": "time",
      "reps_value": "20"
    },
    {
      "id": "ex_043",
      "name": "Наклоны с поднят. руками",
      "description": "Встаньте прямо, поднимите руки вверх. Наклоняйтесь вправо, затем влево, сохраняя руки вытянутыми. Упражнение растягивает боковую поверхность тела и укрепляет косые мышцы живота.",
      "reps_type": "reps",
      "reps_value": "12 на сторону"
    },
    {
      "id": "ex_044",
      "name": "Маршировка на месте",
      "description": "Ходьба на месте с высоким подъёмом колен до уровня бёдер. Руки двигаются в такт. Упражнение активирует сгибатели бедра и служит лёгким кардио-разминкой.",
      "reps_type": "time",
      "reps_value": "40"
    },
    {
      "id": "ex_045",
      "name": "Растяжка 'бабочка'",
      "description": "Сядьте на пол, соедините стопы, колени опущены в стороны. Держа спину прямой, наклоняйтесь вперёд от бёдер. Упражнение растягивает приводящие мышцы бедра и улучшает подвижность тазобедренных суставов.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_046",
      "name": "Отжимания с паузой",
      "description": "Выполните классическое отжимание, но в нижней точке, когда грудь почти касается пола, задержитесь на 2 секунды, затем плавно выжмитесь вверх. Упражнение увеличивает время под нагрузкой и укрепляет грудные мышцы и трицепсы.",
      "reps_type": "reps",
      "reps_value": "8–10"
    },
    {
      "id": "ex_047",
      "name": "Приседания с хлопком",
      "description": "Из глубокого приседа энергично выпрыгните вверх, одновременно хлопнув в ладоши над головой. Приземлитесь мягко и сразу перейдите в следующее повторение. Упражнение развивает взрывную силу ног и координацию.",
      "reps_type": "reps",
      "reps_value": "12"
    },
    {
      "id": "ex_048",
      "name": "Планка на одной руке",
      "description": "В упрощённой планке на коленях и одной руке удерживайте корпус в прямой линии. Упражнение значительно повышает требования к стабилизации кора и плечевого пояса.",
      "reps_type": "time",
      "reps_value": "15 на руку"
    },
    {
      "id": "ex_049",
      "name": "Выпады назад",
      "description": "Из стойки шагните одной ногой назад и опуститесь до угла 90 градусов в обоих коленях. Вернитесь в исходное положение и повторите на другую ногу. Упражнение развивает силу ног и улучшает контроль над тазом.",
      "reps_type": "reps",
      "reps_value": "10 на ногу"
    },
    {
      "id": "ex_050",
      "name": "Подъём корпуса лёжа",
      "description": "Лягте на живот, руки вдоль тела или сложены за головой. Поднимите верхнюю часть корпуса от пола, напрягая мышцы спины. Упражнение укрепляет разгибатели позвоночника и улучшает осанку.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_051",
      "name": "Бёрпи",
      "description": "Из стойки опуститесь в присед, выйдите в планку, выполните отжимание, верните ноги в присед и выполните прыжок вверх с хлопком. Упражнение является комплексным кардио- и силовым движением, вовлекающим всё тело.",
      "reps_type": "reps",
      "reps_value": "8–12"
    },
    {
      "id": "ex_052",
      "name": "Прыжки с приседом",
      "description": "Из положения глубокого приседа совершите мощный прыжок вверх, вытягивая руки. Приземлитесь мягко и сразу переходите в следующее повторение. Упражнение развивает взрывную силу и мощность нижней части тела.",
      "reps_type": "reps",
      "reps_value": "10"
    },
    {
      "id": "ex_053",
      "name": "Скалолаз",
      "description": "В планке на прямых руках быстро и поочерёдно подтягивайте колени к груди, имитируя бег. Упражнение сочетает кардио и проработку мышц кора, особенно нижнего пресса.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_054",
      "name": "Прыжки в выпаде",
      "description": "Из положения выпада совершите прыжок в воздухе, меняя положение ног, и приземлитесь в выпад на противоположную ногу. Упражнение развивает взрывную силу, координацию и устойчивость в движении.",
      "reps_type": "reps",
      "reps_value": "12"
    },
    {
      "id": "ex_055",
      "name": "Планка с поворотом",
      "description": "Из планки на прямых руках поверните корпус в сторону, поднимая одну руку вверх и формируя боковую планку. Вернитесь и повторите на другую сторону. Упражнение укрепляет косые мышцы и улучшает анти-вращательную устойчивость.",
      "reps_type": "reps",
      "reps_value": "10 на сторону"
    },
    {
      "id": "ex_056",
      "name": "Прыжки на одной ноге",
      "description": "Прыгайте вверх, опираясь на одну ногу, стараясь сохранять равновесие и мягкое приземление. Чередуйте ноги. Упражнение развивает баланс, силу и проприоцепцию.",
      "reps_type": "reps",
      "reps_value": "10 на ногу"
    },
    {
      "id": "ex_057",
      "name": "Бег с высокими коленями",
      "description": "Бег на месте с подъёмом колен выше уровня талии. Руки двигаются в противофазе. Упражнение активирует сгибатели бедра и обеспечивает интенсивную кардио-нагрузку.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_058",
      "name": "Отжимания 'паук'",
      "description": "При выполнении отжимания одновременно подтяните одно колено к одноимённому локтю. Вернитесь в планку и повторите на другую сторону. Упражнение интегрирует движение кора с верхней частью тела.",
      "reps_type": "reps",
      "reps_value": "8 на сторону"
    },
    {
      "id": "ex_059",
      "name": "Прыжки 'ножницы'",
      "description": "Прыгая на месте, меняйте положение ног: одна вперёд, другая назад, как при беге. Упражнение развивает координацию и служит динамической кардио-нагрузкой.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_060",
      "name": "Планка 'гора-дол'",
      "description": "Из планки на предплечьях выжмитесь в планку на прямых руках, затем медленно вернитесь на предплечья. Упражнение укрепляет плечи, трицепсы и стабилизаторы корпуса.",
      "reps_type": "reps",
      "reps_value": "15 циклов"
    },
    {
      "id": "ex_061",
      "name": "Приседания 'пистолетик' (упр.)",
      "description": "Держась за опору (или воображая её), выполните присед на одной ноге, вторая нога вытянута вперёд. Упражнение развивает силу, баланс и подвижность тазобедренного сустава.",
      "reps_type": "reps",
      "reps_value": "6 на ногу"
    },
    {
      "id": "ex_062",
      "name": "Выпады в прыжке с поворотом",
      "description": "Из выпада совершите прыжок с поворотом корпуса на 90 градусов, приземляясь в выпад. Упражнение сочетает взрывную силу, координацию и вращательную стабильность.",
      "reps_type": "reps",
      "reps_value": "8 на сторону"
    },
    {
      "id": "ex_063",
      "name": "Планка с подъёмом ног",
      "description": "В планке на прямых руках поочерёдно поднимайте прямые ноги вверх, не отклоняя таз. Упражнение усиливает нагрузку на ягодицы и нижнюю часть кора.",
      "reps_type": "reps",
      "reps_value": "10 на ногу"
    },
    {
      "id": "ex_064",
      "name": "Бёрпи с отжиманием",
      "description": "Полный цикл берпи с обязательным выполнением отжимания в фазе планки. Упражнение значительно повышает нагрузку на грудь и трицепсы по сравнению с классическим берпи.",
      "reps_type": "reps",
      "reps_value": "10"
    },
    {
      "id": "ex_065",
      "name": "Прыжки 'лягушка'",
      "description": "Из глубокого приседа с широко расставленными ногами совершите прыжок вперёд, приземляясь снова в присед. Упражнение развивает взрывную силу и гибкость паха.",
      "reps_type": "reps",
      "reps_value": "8"
    },
    {
      "id": "ex_066",
      "name": "Приседания с подъёмом рук",
      "description": "При опускании в присед поднимите руки вперёд или вверх, при подъёме — опустите. Упражнение улучшает координацию и задействует дельтовидные мышцы.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_067",
      "name": "Планка 'супермен'",
      "description": "В планке на прямых руках одновременно поднимите противоположные руку и ногу, удерживая равновесие. Упражнение укрепляет глубокие стабилизаторы спины и улучшает координацию.",
      "reps_type": "reps",
      "reps_value": "12 на сторону"
    },
    {
      "id": "ex_068",
      "name": "Скручивания с поворотом",
      "description": "Лёжа на спине, поднимайте корпус и одновременно поворачивайте локоть к противоположному колену. Упражнение целенаправленно прорабатывает косые мышцы живота.",
      "reps_type": "reps",
      "reps_value": "16"
    },
    {
      "id": "ex_069",
      "name": "Прыжки с хлопком под ногами",
      "description": "При выполнении прыжков с приседом хлопните в ладоши под ногами в нижней точке. Упражнение развивает координацию и взрывную силу.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_070",
      "name": "Ходьба 'медведь'",
      "description": "На четвереньках, с прямыми коленями, перемещайтесь вперёд, не касаясь коленями пола. Упражнение включает плечи, кор и бёдра, улучшая общую устойчивость.",
      "reps_type": "reps",
      "reps_value": "20 шагов"
    },
    {
      "id": "ex_071",
      "name": "Приседания 'сумо'",
      "description": "Встаньте широко, носки развёрнуты. Опуститесь в глубокий присед, держа спину прямой. Упражнение акцентирует нагрузку на внутреннюю поверхность бедра и ягодицы.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_072",
      "name": "Отжимания на одной ноге",
      "description": "Выполните классическое отжимание, держа одну ногу поднятой вверх. Упражнение повышает требования к стабилизации корпуса и укрепляет ягодичные мышцы.",
      "reps_type": "reps",
      "reps_value": "8 на ногу"
    },
    {
      "id": "ex_073",
      "name": "Прыжки в планке",
      "description": "Из положения планки прыгайте ногами в стороны, как в прыжках 'звёздочка', затем возвращайтесь. Упражнение сочетает статическую и динамическую нагрузку на кор и ноги.",
      "reps_type": "reps",
      "reps_value": "12"
    },
    {
      "id": "ex_074",
      "name": "Выпады 'ходьба'",
      "description": "Перемещайтесь вперёд, чередуя выпады на каждую ногу. Упражнение развивает силу ног, выносливость и координацию при движении.",
      "reps_type": "reps",
      "reps_value": "20 шагов"
    },
    {
      "id": "ex_075",
      "name": "Планка с прыжками",
      "description": "Из планки на прямых руках совершите прыжок, подтягивая обе ноги к груди, затем вернитесь в планку. Упражнение интенсивно нагружает кор и обеспечивает кардио-компонент.",
      "reps_type": "reps",
      "reps_value": "10"
    },
    {
      "id": "ex_076",
      "name": "Бёрпи с прыжком вверх",
      "description": "Максимально интенсивный берпи с высоким прыжком и хлопком над головой. Упражнение развивает взрывную мощность, выносливость и координацию всего тела.",
      "reps_type": "reps",
      "reps_value": "8"
    },
    {
      "id": "ex_077",
      "name": "Прыжки на коробку (вообр.)",
      "description": "Совершайте прыжки вверх, как будто на воображаемую коробку, с акцентом на высоту и мягкое приземление. Упражнение развивает взрывную силу ног и контроль при посадке.",
      "reps_type": "reps",
      "reps_value": "12"
    },
    {
      "id": "ex_078",
      "name": "Приседания 'пружина'",
      "description": "В нижней точке приседа выполняйте серию быстрых микропрыжков, не поднимаясь выше уровня колен. Упражнение создаёт изометрическую пульсирующую нагрузку на квадрицепсы.",
      "reps_type": "time",
      "reps_value": "20"
    },
    {
      "id": "ex_079",
      "name": "Повороты в планке",
      "description": "В планке на прямых руках поворачивайте корпус, касаясь противоположной рукой пола под телом. Упражнение укрепляет косые мышцы и улучшает вращательную стабильность.",
      "reps_type": "reps",
      "reps_value": "10 на сторону"
    },
    {
      "id": "ex_080",
      "name": "Отжимания 'т-поворот'",
      "description": "После отжимания поверните корпус в сторону, поднимая одну руку вверх и формируя букву «Т». Вернитесь и повторите на другую сторону. Упражнение сочетает силу верха тела с ротационной стабильностью кора.",
      "reps_type": "reps",
      "reps_value": "8 на сторону"
    },
    {
      "id": "ex_081",
      "name": "Прыжки 'скакалка'",
      "description": "Имитируйте прыжки через скакалку: частые мелкие прыжки на носках с вращением кистей. Упражнение обеспечивает кардио-нагрузку и улучшает координацию стоп.",
      "reps_type": "time",
      "reps_value": "40"
    },
    {
      "id": "ex_082",
      "name": "Приседания с прыжком назад",
      "description": "Из положения приседа прыгните назад в планку, затем вернитесь в присед. Упражнение сочетает силу ног и динамическую нагрузку на кор.",
      "reps_type": "reps",
      "reps_value": "10"
    },
    {
      "id": "ex_083",
      "name": "Планка 'доска'",
      "description": "В планке на прямых руках перемещайте всё тело влево и вправо, как доска на волнах. Упражнение укрепляет стабилизаторы корпуса и улучшает латеральный контроль.",
      "reps_type": "reps",
      "reps_value": "10 на сторону"
    },
    {
      "id": "ex_084",
      "name": "Выпады с поворотом",
      "description": "В положении выпада поверните корпус в сторону передней ноги, затем вернитесь в центр. Упражнение включает косые мышцы и улучшает мобильность грудного отдела.",
      "reps_type": "reps",
      "reps_value": "10 на сторону"
    },
    {
      "id": "ex_085",
      "name": "Скручивания 'ножницы'",
      "description": "Лёжа на спине, поднимите прямые ноги под углом 45 градусов и выполняйте вертикальные «ножницы» — чередующиеся движения ногами вверх-вниз. Упражнение фокусируется на нижней части пресса.",
      "reps_type": "reps",
      "reps_value": "20"
    },
    {
      "id": "ex_086",
      "name": "Прыжки 'ракета'",
      "description": "Прыгайте вверх, вытягивая всё тело в одну прямую линию: руки над головой, ноги вместе. Упражнение развивает взрывную силу и вытягивающую осанку.",
      "reps_type": "reps",
      "reps_value": "12"
    },
    {
      "id": "ex_087",
      "name": "Отжимания 'алмаз'",
      "description": "Выполните отжимание с руками, сведёнными под грудью так, чтобы большие пальцы и указательные образовывали ромб. Упражнение акцентирует нагрузку на трицепсы.",
      "reps_type": "reps",
      "reps_value": "8–10"
    },
    {
      "id": "ex_088",
      "name": "Приседания 'пульс'",
      "description": "В нижней точке приседа выполняйте короткие, амплитудные пульсации вверх-вниз без полного выпрямления ног. Упражнение создаёт интенсивное метаболическое напряжение в мышцах бёдер.",
      "reps_type": "time",
      "reps_value": "20"
    },
    {
      "id": "ex_089",
      "name": "Планка 'часы'",
      "description": "В планке на прямых руках поворачивайте корпус и касайтесь пола одной рукой в разных направлениях (например, как стрелки часов). Упражнение повышает требования к пространственной ориентации и стабильности.",
      "reps_type": "reps",
      "reps_value": "6 кругов"
    },
    {
      "id": "ex_090",
      "name": "Бёрпи 'спринт'",
      "description": "После выполнения берпи с прыжком немедленно совершите короткий рывок вперёд на 2 шага. Упражнение сочетает взрывную силу и ускорение.",
      "reps_type": "reps",
      "reps_value": "8"
    },
    {
      "id": "ex_091",
      "name": "Приседания 'качели'",
      "description": "При подъёме из приседа резко поднимите руки вверх, как маятник, используя инерцию. Упражнение развивает координацию и динамическую силу.",
      "reps_type": "reps",
      "reps_value": "15"
    },
    {
      "id": "ex_092",
      "name": "Отжимания 'взрыв'",
      "description": "Выполните отжимание с такой силой, чтобы руки оторвались от пола. Приземлитесь мягко и продолжите. Упражнение развивает взрывную мощность грудных мышц и трицепсов.",
      "reps_type": "reps",
      "reps_value": "6–8"
    },
    {
      "id": "ex_093",
      "name": "Прыжки 'силуэт'",
      "description": "Прыгайте, последовательно принимая в воздухе разные позы: «звёздочка», присед, планка. Упражнение развивает координацию, контроль тела и кардиовыносливость.",
      "reps_type": "time",
      "reps_value": "40"
    },
    {
      "id": "ex_094",
      "name": "Выпады 'прыжок назад'",
      "description": "Из положения выпада прыгните назад в планку, затем вернитесь в выпад без смены ноги. Упражнение увеличивает нагрузку на кор и ноги.",
      "reps_type": "reps",
      "reps_value": "8 на ногу"
    },
    {
      "id": "ex_095",
      "name": "Планка 'паук'",
      "description": "В планке на прямых руках подтягивайте одно колено к противоположному локтю. Упражнение интенсивно включает косые мышцы и нижний пресс.",
      "reps_type": "reps",
      "reps_value": "10 на сторону"
    },
    {
      "id": "ex_096",
      "name": "Скручивания 'велосипед'",
      "description": "Лёжа на спине, поднимите ноги и выполняйте движения, имитирующие езду на велосипеде, одновременно касаясь локтем противоположного колена. Упражнение комплексно прорабатывает весь пресс.",
      "reps_type": "time",
      "reps_value": "30"
    },
    {
      "id": "ex_097",
      "name": "Прыжки 'тень'",
      "description": "Выполняйте лёгкие, частые прыжки на месте, имитируя боксёрские движения с минимальным подъёмом ног. Упражнение развивает ловкость, ритм и выносливость.",
      "reps_type": "time",
      "reps_value": "40"
    },
    {
      "id": "ex_098",
      "name": "Приседания 'волна'",
      "description": "Медленно опускайтесь в присед (3–4 секунды), затем резко и мощно вытолкнитесь вверх. Упражнение сочетает эксцентрическую и концентрическую фазы для максимального развития силы.",
      "reps_type": "reps",
      "reps_value": "12"
    },
    {
      "id": "ex_099",
      "name": "Отжимания 'армейские'",
      "description": "Выполните отжимание с широко расставленными руками, обеспечивая максимальную амплитуду движения и 2-секундную паузу в нижней точке. Упражнение развивает грудные мышцы и стабилизаторы плеч.",
      "reps_type": "reps",
      "reps_value": "10"
    },
    {
      "id": "ex_100",
      "name": "Бёрпи 'максимум'",
      "description": "Полный цикл берпи: присед → планка → отжимание → прыжок с хлопком над головой. Упражнение представляет собой пиковую кардио-силовую нагрузку, вовлекающую всё тело.",
      "reps_type": "reps",
      "reps_value": "6–8"
    }
  ],
  "difficulty_levels": {
    "easy": [
      "ex_001", "ex_002", "ex_003", "ex_004", "ex_005",
      "ex_006", "ex_007", "ex_008", "ex_009", "ex_010",
      "ex_011", "ex_012", "ex_013", "ex_014", "ex_015",
      "ex_016", "ex_017", "ex_018", "ex_019", "ex_020",
      "ex_021", "ex_022", "ex_023", "ex_024", "ex_025",
      "ex_026", "ex_027", "ex_028", "ex_029", "ex_030"
    ],
    "moderate": [
      "ex_002", "ex_003", "ex_005", "ex_008", "ex_010",
      "ex_011", "ex_012", "ex_021", "ex_031", "ex_032",
      "ex_033", "ex_034", "ex_035", "ex_036", "ex_037",
      "ex_038", "ex_039", "ex_040", "ex_041", "ex_042",
      "ex_043", "ex_044", "ex_045", "ex_046", "ex_047",
      "ex_048", "ex_049", "ex_050", "ex_051", "ex_052",
      "ex_053", "ex_054", "ex_055", "ex_056", "ex_057",
      "ex_058", "ex_059", "ex_060", "ex_061", "ex_062",
      "ex_063", "ex_064", "ex_065", "ex_066", "ex_067",
      "ex_068", "ex_069", "ex_070", "ex_071", "ex_072"
    ],
    "hard": [
      "ex_002", "ex_003", "ex_008", "ex_032", "ex_036",
      "ex_038", "ex_041", "ex_051", "ex_052", "ex_053",
      "ex_054", "ex_055", "ex_056", "ex_057", "ex_058",
      "ex_059", "ex_060", "ex_061", "ex_062", "ex_063",
      "ex_064", "ex_065", "ex_066", "ex_067", "ex_068",
      "ex_069", "ex_070", "ex_071", "ex_072", "ex_073",
      "ex_074", "ex_075", "ex_076", "ex_077", "ex_078",
      "ex_079", "ex_080", "ex_081", "ex_082", "ex_083",
      "ex_084", "ex_085", "ex_086", "ex_087", "ex_088",
      "ex_089", "ex_090", "ex_091", "ex_092", "ex_093",
      "ex_094", "ex_095", "ex_096", "ex_097", "ex_098",
      "ex_099", "ex_100", "ex_031", "ex_033", "ex_034",
      "ex_035", "ex_037", "ex_039", "ex_040", "ex_042",
      "ex_046", "ex_047", "ex_049", "ex_050", "ex_060"
    ]
  }
}